[
  {
    "name": "Yopeso",
    "logo": "/images/yopeso-logo.png",
    "background": "moving-gradient-1",
    "position": "Senior Software Engineer",
    "start": "Nov. 2023",
    "end": "Present",
    "highlight": "text-blue-400",
    "points": [
      "Working as a Senior Software Engineer on contract for Klarna Bank.",
      "Involved in various development tasks for backend and frontend components."
    ]
  },
  {
    "name": "Pentalog",
    "logo": "/images/pentalog-logo.png",
    "background": "moving-gradient-2",
    "position": "Software Engineer",
    "start": "May 2022",
    "end": "Jan 2023",
    "highlight": "text-indigo-400",
    "points": [
      "On Skillvalue project:",
      "Developed web backend components using Django for skillvalue.com, improving security to ASVS L1 standards.",
      "Refactored and enhanced the login system for the platform and added multiple frontend features using Angular.",
      "Worked on the LegalVision project to implement backend domain models, authentication services, and integrate HubSpot CRM.",
      "Managed CI/CD processes and worked on marketplace connectors for Lengow project."
    ]
  },
  {
    "name": "3Pillar Global",
    "logo": "/images/3pillar-logo.png",
    "background": "bg-white",
    "position": "Intermediate Software Engineer",
    "start": "Feb 2020",
    "end": "May 2022",
    "highlight": "text-orange-400",
    "points": [
      "Developed unit testing scenarios using pyATS, and implemented Groovy-based Jenkins pipelines for automation.",
      "Configured CISCO devices manually and built testbeds for automation testing.",
      "Mastered the Perforce Helix versioning system and managed baselines for CISCO devices.",
      "Facilitated internal product trainings as part of the Community of Practice.",
      "Created complex tests from scratch and integrated them into existing test suites, preparing the execution plan.",
      "Discussed requirements with stakeholders and implemented new features into existing frameworks.",
      "Mentored students for 14 weeks, covering topics like Python, scripting, and Linux.",
      "Implemented an API and added support for a new cloud platform into the automation framework.",
      "Held presentations for multiple teams on new framework features."
    ]
  },
  {
    "name": "Software Dev Academy",
    "logo": "/images/software-dev-academy-logo.png",
    "background": "bg-slate-400",
    "position": "Mentor",
    "start": "Sept. 2023",
    "end": "Present",
    "highlight": "text-indigo-400",
    "points": [
      "My role is to provide guidance, support, and expertise to individuals seeking to develop their skills and advance their careers in IT",
      "I offer valuable insights, share industry best practices, and help you navigate challenges and make informed decisions to achieve your goals in the IT industry."
    ]
  }
]
